Repository: zipf/perldoc-es
Catalog: tm/_Kephra_ref/kephra_es.tmx
Source language: en_us
Languages: es

source: english
es: español

source: en
es: es

source: global localisation
es: localización global

source: untitled
es: sin título

source: File
es: Archivo

source: Open
es: Abrir

source: Save
es: Guardar

source: Close
es: Cerrar

source: Recently Closed
es: Cerrados recientemente

source: Session
es: Sesión

source: Edit
es: Editar

source: History
es: Historial

source: Line
es: Línea

source: Select
es: Seleccionar

source: Selection
es: Selección

source: Format
es: Formato

source: Comment
es: Comentario

source: Convert
es: Convertir

source: Search
es: Buscar

source: Attributes
es: Atributos

source: Find Functions
es: Funciones para buscar

source: Replace Functions
es: Funciones para reemplazar

source: Marker
es: Marca

source: Goto Bookmark
es: Ir a marcador

source: Toggle Bookmark
es: Alternar marcador

source: Tools
es: Herramientas

source: Output
es: Resultados

source: Templates
es: Plantillas

source: Document
es: Documento

source: Change
es: Cambiar

source: Syntaxmode
es: Modo de sintaxis

source: Compiled
es: Compilados

source: Interpreted
es: Interpretados

source: Data Structure
es: Estructuras de datos

source: Documents
es: Documentos

source: Webprogramming
es: Programación web

source: Special
es: Especiales

source: Encoding
es: Codificación

source: Tab Width
es: Ancho de tabulación

source: Lineendchars
es: Caracteres de fin de línea

source: Write Protection
es: Protección contra escritura

source: View
es: Ver

source: Main Window
es: Ventana principal

source: App Bars
es: Barras de aplicación

source: Context Menus
es: Menús contextuales

source: Edit Panel
es: Panel de edición

source: Text Margin
es: Margen del texto

source: Folding
es: Plegado

source: Config
es: Configuración

source: Language
es: Idioma

source: Global Config File
es: Archivo de configuración global

source: User Interface
es: Interfaz de usuario

source: Localisation
es: Localización

source: Syntaxmodes A - M
es: Modos de sintaxis A - M

source: Syntaxmodes N - Z
es: Modos de sintaxis N - Z

source: Help
es: Ayuda

source: Chars
es: Caracteres

source: Column
es: Columna

source: Lines
es: Líneas

source: soft tabs
es: espacios

source: hard tabs
es: tabulaciones

source: Now is
es: Ahora es

source: Last change
es: Última modificación

source: Date
es: Fecha

source: Time
es: Hora

source: caret (text cursor) position
es: Posición del símbolo de intercalación (cursor del texto)

source: selection size or position in percentage
es: Tamaño o posición de selección en porcentaje

source: changes the current set syntaxmode
es: Cambia el modo de sintaxis establecido actualmente

source: encoding settings
es: Configuración de codificación

source: change the use of tabs and spaces
es: Alterna tabulaciones y espacios

source: view or change the end of line character
es: Permite ver o cambiar el carácter de fin de línea

source: info field, can also show infos about the current file
es: Campo de información; también puede mostrar información acerca del archivo actual

source: Exit
es: Salir

source: Exit Without Save
es: Salir sin guardar

source: New
es: Nuevo

source: Open ...
es: Abrir...

source: Open Dir ...
es: Abrir directorio...

source: Reload
es: Volver a cargar

source: Reload All
es: Volver a cargar todos

source: Rename ...
es: Cambiar nombre...

source: Insert From File ...
es: Insertar desde archivo...

source: Save All
es: Guardar todos

source: Save As ...
es: Guardar como...

source: Save Copy ...
es: Guardar copia...

source: Print ...
es: Imprimir...

source: Close All
es: Cerrar todos

source: Close Other
es: Cerrar otros

source: Close Unsaved
es: Cerrar sin guardar

source: Close All Unsaved
es: Cerrar todos sin guardarlos

source: Close Other Unsaved
es: Cerrar otros sin guardarlos

source: Add ...
es: Agregar...

source: Save ...
es: Guardar...

source: Import ...
es: Importar...

source: Export ...
es: Exportar...

source: Restore Backup
es: Restaurar copia de seguridad

source: Save Backup
es: Guardar copia de seguridad

source: Open All
es: Abrir todos

source: Undo
es: Deshacer

source: Redo
es: Rehacer

source: Fast Undo
es: Deshacer rápido

source: Fast Redo
es: Rehacer rápido

source: Jump To Begin
es: Ir al principio

source: Jump To End
es: Ir al final

source: Clear Records
es: Borrar registros

source: Cut
es: Cortar

source: Copy
es: Copiar

source: Paste
es: Pegar

source: Replace
es: Reemplazar

source: Delete
es: Eliminar

source: Del Tab
es: Eliminar tabulación

source: Duplicate
es: Duplicar

source: Delete Left
es: Eliminar parte izquierda

source: Delete Right
es: Eliminar parte derecha

source: Move Line Up
es: Subir línea

source: Move Line Down
es: Bajar línea

source: Move Page Up
es: Retroceder página

source: Move Page Down
es: Avanzar página

source: Uppercase
es: A mayúsculas

source: Lowercase
es: A minúsculas

source: Titlecase
es: En título

source: Sentencecase
es: En oración

source: Spaces To Tabs
es: Espacios en tabulaciones

source: Tabs To Spaces
es: Tabulaciones en espacios

source: Spaces To Entities
es: Espacios en entidades

source: Entities To Spaces
es: Entidades en espacios

source: Chars To Entities
es: Caracteres en entidades

source: Entities To Chars
es: Entidades en caracteres

source: Add Perl Style Comment
es: Agregar comentario de Perl

source: Remove Perl Style Comment
es: Quitar comentario de Perl

source: Toggle Perl Style Comment
es: Alternar comentario de Perl

source: Add C Style Comment
es: Agregar comentario de C

source: Remove C Style Comment
es: Quitar comentario de C

source: Add XML Style Comment
es: Agregar comentario de XML

source: Remove XML Style Comment
es: Quitar comentario de XML

source: Align On Begin
es: Alinear al principio

source: Blockformat On Right Margin
es: Margen derecho de bloque

source: Blockformat On Width ...
es: Ancho de bloque...

source: Linebreaks Before Right Margin
es: Saltos de línea antes del margen derecho

source: Linebreaks Before Width ...
es: Saltos de línea antes del ancho...

source: Indent Space
es: Aplicar sangría de un espacio

source: Dedent Space
es: Eliminar sangría de un espacio

source: Indent Tab
es: Aplicar sangría de una tabulación

source: Dedent Tab
es: Eliminar sangría de una tabulación

source: Trim Trailing Whitespace
es: Quitar espacio en blanco final

source: Join Lines
es: Unir líneas

source: Move Left
es: Mover a la izquierda

source: Move Right
es: Mover a la derecha

source: Move Up
es: Subir

source: Move Down
es: Bajar

source: Indention 2 Whitespace
es: Aplicar sangría de 2 espacios

source: Indention 2 Tab
es: Aplicar sangría de 2 tabulaciones

source: Spaces 2 Tabs
es: Convertir espacios en tabulaciones

source: Tabs 2 Whitespace
es: Convertir tabulaciones en espacios

source: Trim Trailing Whitepace
es: Quitar espacio en blanco final

source: Select All
es: Seleccionar todo

source: Toggle
es: Alternar

source: Item
es: Elemento

source: Auto Wrap
es: Ajuste automático

source: Incremental Search
es: Búsqueda incremental

source: Regular Expression
es: Expresión regular

source: Match Case
es: Coincidir mayúsculas y minúsculas

source: Whole Word only
es: Sólo palabras completas

source: Word Begin
es: Principio de palabra

source: Open Documents
es: Documentos abiertos

source: Find Previous
es: Buscar anterior

source: Find Next
es: Buscar siguiente

source: Find First
es: Buscar primero

source: Find Last
es: Buscar último

source: Find Selection
es: Buscar selección

source: Replace Backward
es: Reemplazar hacia atrás

source: Replace Forward
es: Reemplazar hacia delante

source: Replace All
es: Reemplazar todo

source: Replace With Confirm
es: Reemplazar con confirmación

source: Replace Into Selection
es: Reemplazar en selección

source: Goto Last Edit
es: Ir a último cambio

source: Goto Line Number ...
es: Ir a línea...

source: Previous Marker in Doc
es: Marca anterior en el documento

source: Next Marker in Doc
es: Marca siguiente en el documento

source: Goto Previous Marker
es: Ir a la marca anterior

source: Goto Next Marker
es: Ir a la marca siguiente

source: Toggle Marker Here
es: Aplicar o quitar marca

source: Delete Marker in Doc
es: Eliminar marca del documento

source: Delete All Marker
es: Eliminar todos las marcas

source: Delete Doc Bookmarks
es: Eliminar marcadores del documento

source: Delete All Bookmarks
es: Eliminar todos los marcadores

source: Note
es: Nota

source: Note Selection
es: Selección de nota

source: Run Script
es: Ejecutar script

source: Stop Script
es: Detener script

source: Selection in Dec
es: Selección en decimal

source: Selection in Hex
es: Selección en hexadecimal

source: Color Picker
es: Selector de colores

source: Time Date
es: Fecha y hora

source: Insert Var
es: Insertar variable

source: Copy String
es: Copiar cadena

source: Autoindention
es: Sangría automática

source: Braceindention
es: Sangría automática de llaves

source: Bracecompletion
es: Cierre automático de llaves

source: Align
es: Alinear

source: Switch Back
es: Volver

source: Previous Tab
es: Pestaña anterior

source: Next Tab
es: Pestaña siguiente

source: As Attribute
es: Como atributo

source: Always On
es: Siempre activada

source: Always Off
es: Siempre desactivada

source: Autoselect
es: Selección automática

source: None
es: Ninguno

source: UNIX Shell
es: Shell de UNIX

source: Tabs (HT = hard tabs)
es: Tabulaciones

source: Spaces (ST = soft tabs)
es: Espacios

source: Use Tabs
es: Usar tabulaciones

source: Config Dialog ...
es: Cuadro de diálogo Configuración...

source: Search Dialog
es: Cuadro de diálogo Buscar

source: Replace Dialog
es: Cuadro de diálogo Reemplazar

source: About ...
es: Acerca de...

source: Keymap ...
es: Mapa de teclado...

source: Advanced Tour
es: Tutorial avanzado

source: Credits
es: Créditos

source: Featurelist
es: Lista de características

source: Navigation Guide
es: Guía de navegación

source: Welcome
es: Pantalla de bienvenida

source: This Version
es: Esta versión

source: Custom
es: Personalizado

source: Default
es: Predeterminado

source: No Menu
es: Ningún menú

source: Lineend Marker
es: Marca de fin de línea

source: Caret Line
es: Símbolo de intercalación

source: Bracelight
es: Resaltado de llaves

source: Indention Guide
es: Guía de sangría

source: Right Margin
es: Margen derecho

source: Whitespace
es: Espacio en blanco

source: All
es: Todos

source: Here
es: Aquí

source: Level
es: Nivel

source: Recursively
es: De forma recursiva

source: Font
es: Fuente

source: Line Wrap
es: Ajuste de línea

source: Left Margin
es: Margen izquierdo

source: Marker Margin
es: Margen de marca

source: Line Number
es: Número de línea

source: Fold Margin
es: Margen de plegado

source: Maximize Editpanel
es: Maximizar panel de edición

source: Zoom In
es: Acercar

source: Zoom Out
es: Alejar

source: Notepad
es: Bloc de notas

source: Main Menu
es: Menú principal

source: Searchbar
es: Barra de búsqueda

source: Statusbar
es: Barra de estado

source: Statuscontext
es: Contexto de estado

source: File Date
es: Fecha del archivo

source: File Size
es: Tamaño del archivo

source: Nothing
es: Nada

source: Tabbar
es: Barra de pestañas

source: Main Toolbar
es: Barra de herramientas principal

source: Bug Tracker
es: Seguimiento de errores

source: Online Docs
es: Documentación en línea

source: Feature Wish
es: Solicitar característica

source: Perl Forum
es: Foro de Perl

source: Fullscreen
es: Pantalla completa

source: Stay On Top
es: Mantener en primer plano

source: Transparent
es: Transparente

source: Load From ...
es: Cargar desde...

source: Load Backup
es: Cargar copia de seguridad

source: Load Defaults
es: Cargar configuración predeterminada

source: Merge With ...
es: Combinar con...

source: Command List
es: Lista de comandos

source: Contextmenus
es: Menús contextuales

source: Toolbar
es: Barra de herramientas

source: shut down the application and save settings and files
es: Cierra la aplicación y guarda la configuración y los archivos

source: shut down app without saving the open files
es: Cierra la aplicación sin guardar los archivos abiertos

source: opens a new empty text
es: Abre un nuevo archivo de texto

source: display an existing textfile as a new document
es: Muestra un archivo de texto existente como un documento nuevo

source: open all files of this directory
es: Abre todos los archivos de este directorio

source: read file from hard drive and replace content with displayed
es: Lee un archivo del disco duro y actualiza el mostrado

source: reload all opened files
es: Vuelve a cargar todos los archivos abiertos

source: change current files name
es: Cambia el nombre del archivo actual

source: insert file content at caret position
es: Inserta el contenido del archivo en la posición del cursor

source: save the displayed state of the current file
es: Guarda el estado mostrado del archivo actual

source: save all the currently opened files
es: Guarda todos los archivos abiertos actualmente

source: save current document under different file name
es: Guarda el documento actual con un nombre distinto

source: save doc with different name, keep current version open
es: Guarda el documento con un nombre distinto y mantiene abierta la versión actual

source: print the current document
es: Imprime el documento actual

source: close current document, if preset the file will be saved
es: Cierra el documento actual; según la configuración, se guarda el archivo

source: close all open documents
es: Cierra todos los documentos abiertos

source: close all open documents but not the current visible
es: Cierra todos los documentos abiertos menos el visible actualmente

source: close current document without save it before it
es: Cierra el documento actual sin guardarlo

source: close all document without save it before it
es: Cierra todos los documentos sin guardarlos

source: unsaved closing of all open docs but not the current visible
es: Cierra todos los documentos abiertos sin guardarlos, menos el visible actualmente

source: restore an once saved file session
es: Restaura una sesión de archivo guardada

source: add files of a saved file session
es: Agrega archivos de una sesión de archivo guardada

source: save order and properties of this file session
es: Guarda el orden y las propiedades de esta sesión de archivo

source: open files session from another editors format
es: Abre una sesión de archivo con formato de otro editor

source: save files session in another editors format
es: Guarda una sesión de archivo con formato de otro editor

source: restore the backup session
es: Restaura la sesión de copia de seguridad

source: remember current files as the backup session
es: Guarda los archivos actuales como sesión de copia de seguridad

source: restore all listed closed files from history
es: Restaura todos los archivos cerrados de la lista del historial

source: undo the last change in the current document
es: Deshace el último cambio realizado al documento actual

source: redo the last change made undone
es: Vuelve a aplicar el último cambio deshecho

source: go several steps back in edit history
es: Retrocede varios pasos en el historial de edición

source: go several steps forward in edit history
es: Avanza varios pasos en el historial de edición

source: go back to the state before the first edit
es: Restablece el estado anterior al primer cambio

source: go forward to the state after the last edit
es: Avanza al estado posterior al último cambio

source: deleting history of all editing changes
es: Elimina el historial de cambios de edición

source: cut selected text and store it in the clipboard
es: Corta el texto seleccionado y lo almacena en el portapapeles

source: copy selected text to the clipboard
es: Copia el texto seleccionado al portapapeles

source: insert text from the clipboard
es: Inserta texto desde el portapapeles

source: replace selected text with the clipboard
es: Reemplaza el texto seleccionado con el contenido del portapapeles

source: delete and forget selected text
es: Elimina y descarta el texto seleccionado

source: cut current line and store it in the clipboard
es: Corta la línea actual y la almacena en el portapapeles

source: copy current line to the clipboard
es: Copia la línea actual al portapapeles

source: insert below a copy of the current line
es: Inserta debajo una copia de la línea actual

source: replace current line with the clipboard
es: Reemplaza la línea actual con el contenido del portapapeles

source: delete and forget current line
es: Elimina y descarta la línea actual

source: delete left side from textcursor of current line
es: Elimina lo que hay a la izquierda del cursor de texto en la línea actual

source: delete right side from textcursor of current line
es: Elimina lo que hay a la derecha del cursor de texto en la línea actual

source: move current line one line up
es: Pasa la línea actual a la anterior

source: move current line one line down
es: Pasa la línea actual a la siguiente

source: move current line one page up
es: Retrocede la línea actual una página

source: move current line one page down
es: Avanza la línea actual una página

source: turn selected text to uppercase
es: Convierte el texto seleccionado a mayúsculas

source: turn selected text to lowercase
es: Convierte el texto seleccionado a minúsculas

source: turn first char of every word uppercase
es: Convierte a mayúscula el primer carácter de cada palabra

source: turn first char of every sentence uppercase
es: Convierte a mayúscula el primer carácter de la frase

source: convert groups of whitespace to tabs
es: Convierte grupos de espacios en tabulaciones

source: depends on current tab width
es: Depende del ancho de tabulación actual

source: convert all whitespace to &npsp;
es: Convierte todos los espacios en &npsp;

source: convert &npsp; to whitespace
es: Convierte &npsp; en espacios

source: convert ISO 8859-1 character to HTML entities
es: Convierte caracteres ISO 8859-1 en entidades HTML

source: convert HTML entities to ISO 8859-1 characters
es: Convierte entidades HTML en caracteres ISO 8859-1

source: insert \# after every indention
es: Inserta \# a continuación de cada sangría

source: remove all \# following the indention
es: Elimina los caracteres \# que hay a continuación de la sangría

source: comment all uncommented lines and vici versa
es: Marca como comentario todas las líneas no marcadas y viceversa

source: surround selection with / * and * /
es: Escribe la selección entre / * y * /

source: remove all / * and * / in the selection
es: Elimina todos los caracteres / * y * / de la selección

source: surround selection with <!-- and -->
es: Escribe la selección entre <!-- y -->

source: remove all <!-- and --> in the selection
es: Elimina los caracteres <!-- y --> de la selección

source: align line indentions on first line
es: Alinea las sangrías de línea con la primera línea

source: format to textblock, that not cross right margin
es: Aplica formato al bloque de texto de forma que no invada el margen derecho

source: format to textblock with chosen width ...
es: Aplica al bloque de texto el ancho especificado...

source: split lines before they reach the right margin
es: Interrumpe las líneas antes de que lleguen al margen derecho

source: split lines to a chosen width ...
es: Interrumpe las líneas según el ancho especificado...

source: increase indention of the selected lines by 1
es: Aumenta en un espacio la sangría de las líneas seleccionadas

source: decrease indention of the selected lines by 1
es: Reduce en un espacio la sangría de las líneas seleccionadas

source: increase indention by current tab size
es: Aumenta la sangría una cantidad equivalente al ancho de tabulación

source: decrease indention by current tab size
es: Reduce la sangría una cantidad equivalente al ancho de tabulación

source: delete whitespace on line endings
es: Elimina el espacio en blanco del final de cada línea

source: delete end of line (EOL) symbols
es: Elimina los símbolos de fin de línea (EOL)

source: move selection one character left
es: Mueve la selección un carácter a la izquierda

source: move selection one character right
es: Mueve la selección un carácter a la derecha

source: move selection one line up
es: Sube la selección una línea

source: move selection one line down
es: Baja la selección una línea

source: move selection one page up
es: Sube la selección una página

source: move selection one page down
es: Baja la selección una página

source: convert tabs between linestart and first word
es: Convierte tabulaciones entre el principio de línea y la primera palabra

source: convert spaces between linestart and first word
es: Convierte espacios entre el principio de línea y la primera palabra

source: convert all spaces to tabs in the current doc
es: Convierte todos los espacios en tabulaciones en el documento actual

source: convert all tabs to spaces in the current doc
es: Convierte todas las tabulaciones en espacios en el documento actual

source: delete all trailing whitespace
es: Elimina todo el espacio en blanco del final

source: select entire document
es: Selecciona el documento completo

source: toggle between selectin a word, a line, a block or nothing
es: Alterna entre seleccionar una palabra, una línea, un bloque o nada

source: toggle selection between contents of braces or quotings
es: Alterna la selección del contenido entre llaves o entre comillas

source: search and replace only within selected text
es: Busca y reemplaza sólo dentro del texto seleccionado

source: search and replace in whole current document
es: Busca y reemplaza en todo el documento actual

source: search and replace in all open documents
es: Busca y reemplaza en todos los documentos abiertos

source: find the previous match of the textsearch
es: Busca la coincidencia anterior del texto buscado

source: find the next match of the textsearch
es: Busca la siguiente coincidencia del texto buscado

source: find first textsearch match in document
es: Busca la primera coincidencia del texto buscado en el documento

source: find last textsearch match in document
es: Busca la última coincidencia del texto buscado en el documento

source: remember selected text as current search item
es: Busca el texto seleccionado actualmente

source: replace selection and find previous match
es: Reemplaza la selección y busca la coincidencia anterior

source: replace selection and find next match
es: Reemplaza la selección y busca la siguiente coincidencia

source: replace all matches in current search range
es: Reemplaza todas las coincidencias en el intervalo de búsqueda actual

source: confirm or reject to replace every particular match
es: Permite confirmar o rechazar la sustitución de cada coincidencia específica

source: remember selected text as current replace item
es: Reemplaza el texto seleccionado actualmente

source: jump to position of last change in this document
es: Salta a la posición del último cambio en este documento

source: jump to line with chosen number
es: Salta al número de línea elegido

source: go to the previous marker (upwards) in this document
es: Salta a la marca anterior del documento

source: go to the next marker (downwards) in this document
es: Salta a la siguiente marca del documento

source: go to the previous marker here or in some previous document
es: Salta a la marca anterior del documento o de algún documento anterior

source: go to the next marker here or in some next document
es: Salta a la siguiente marca del documento o de algún documento siguiente

source: set a marker in current line or delete if already present
es: Establece una marca en la línea actual o la elimina si ya existe

source: delete marker just in the current document
es: Elimina la marca sólo en el documento actual
